Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: Returns a four-element list giving the user and system times in seconds for this process and any exited children of this process.
es_es: Devuelve una lista de cuatro elementos dando los tiempos de usuario y sistema en segundos, para este proceso y cualquier hijo de este proceso que haya terminado.

source: Hash subscripts are similar, only instead of square brackets curly brackets are used.
es_es: Los índices en los Hash son similares, pero en lugar de usar corchetes se usan llaves.

source: If locale matching rules are in effect, the case map is taken from the current locale for code points less than 255, and from Unicode rules for larger code points.
es_es: Si están activas las reglas de coincidencia local, el mapeo de caja se toma de la configuración local actual para los puntos de código menores que 255, y de las reglas Unicode para los puntos de código superiores.

source: Options are as with m// with the addition of the following replacement specific options:
es_es: Las opciones son como las de m// con la adición de las opciones de reemplazo específicas siguientes:

source: If the string cannot be cleanly converted to a numeric, Perl will give the warning B<Argument "the string" isn't numeric in negation (-) at ...>.
es_es: Si la cadena no se puede convertir de una forma limpia a numérico, Perl mostrará la advertencia B<Argument "the string" isn't numeric in negation (-) at ...>.

source: Starting with Perl 5.9.2, integer and floating-point formats, along with the C<p> and C<P> formats and C<()> groups, may all be followed by the C<< > >> or C<< < >> endianness modifiers to respectively enforce big- or little-endian byte-order.
es_es: A partir de Perl 5.9.2, los formatos enteros y de punto flotante, junto con los formatos C<p> y C<P> y los grupos C<()>, podrán ser seguidos por los modificadores de ordenación de bytes C<< > >> o C<< < >>, para forzar, respectivamente, el orden de bytes big-endian o little-endian.

source: $n = 0b1110011; # binary integer
es_es: $n = 0b1110011; # entero binario

source: If I<both> operands pass the test, then the expression is treated as boolean; otherwise, smart matching is used.
es_es: Si I<ambos> operandos pasan el test, entonces la expresión es tratada como un booleano; de otra forma, se usará coincidencia inteligente.

source: Because C<$@> is a global variable and C<eval> may be used within object implementations, be careful that analyzing the error object doesn't replace the reference in the global variable.
es_es: Dado que C<$@> es una variable global y C<eval> puede ser usado dentro de las implementaciones de objetos, tenga el cuidado que al analizar el objeto error no sustituya la referencia en la variable global.

source: or do this:
es_es: o haga esto:

source: \A Match only at beginning of string
es_es: \A Coincide solo con el comienzo de la cadena

source: B<NOTE:> C<$REGERROR> and C<$REGMARK> are not magic variables like C<$1> and most other regex-related variables.
es_es: B<NOTE:> C<$REGERROR> y C<$REGMARK> no son variables mágicas como C<$1> y la mayoría de las otras variables relacionadas con las expresiones regulares.

source: C<die> raises an exception.
es_es: C<die> lanza una excepción.

source: status for next file
es_es: para el siguiente archivo

source: ^ Match the beginning of the line
es_es: ^ Coincide con el principio de la línea

source: However, C<use integer; ~0> is C<-1> on two's-complement machines.
es_es: Sin embargo, C<use integer; ~0> es C<-1> en las máquinas con complemento a dos.

source: This is serious if stdin is attached to a terminal, and perl is running as root.
es_es: Esto es grave si stdin está conectado a un terminal, y perl es ejecutado como root.

source: The patterns used in Perl pattern matching evolved from those supplied in the Version 8 regex routines.
es_es: Los patrones usados en el sistema de coincidencias de Perl evolucionaron desde los suministrados por las rutinas I<regex> versión 8.

source: Unfortunately.
es_es: Por desgracia.

source: for my $elem (@elements) {
es_es: for my $elemento (@elementos) {

source: Creates a digest string exactly like the crypt(3) function in the C library (assuming that you actually have a version there that has not been extirpated as a potential munition).
es_es: Crea una cadena resumen exactamente igual que la función crypt(3) de la biblioteca C (asumiendo que realmente tenga una versión de la que no haya sido extirpada por ser considerada un arma potencial).

source: In other words, the two zero-width assertions next to each other work as though they're ANDed together, just as you'd use any built-in assertions: C</^$/> matches only if you're at the beginning of the line AND the end of the line simultaneously.
es_es: En otras palabras, las dos aserciones de ancho cero, una junto a la otra, trabajan como si fueran unidas por un Y, tal y como lo haría usando cualquier aserción integrada: C</^$/> coincide sólo si está al comienzo de la línea Y al final de la línea, al mismo tiempo.

source: C<\1> through C<\9> are always interpreted as backreferences.
es_es: De C<\1> a C<\9>, son siempre interpretadas como contrareferencias.

source: Consider the following pattern.
es_es: Consideremos el siguiente patrón.

source: In Perl the groups are numbered sequentially regardless of being named or not.
es_es: En Perl los grupos están numerados secuencialmente, independientemente de tener nombres o no.

source: Here's an example that makes sure that whoever runs this program knows their password:
es_es: Aquí hay un ejemplo que se asegura que quien corra el programa conoce su contraseña:

source: Their usage in production code should be noted to avoid problems during upgrades.
es_es: Su uso en el código de producción debe anotarse para evitar problemas durante las actualizaciones.

source: Although Perl automatically converts strings into numbers as needed, this automatic conversion assumes base 10.
es_es: Aunque Perl convierte automáticamente las cadenas en números según sea necesario, esta conversión automática asume que es en base 10.

source: S An unsigned short value.
es_es: S Un valor de un corto sin signo.

source: The current plan is for code freezes as follows
es_es: El plan actual es que el código quede congelado de la siguiente manera

source: Thank you, Perl Monks.
es_es: Gracias, Perl Monks.

source: When C<S> can match, it is a better match than when only C<T> can match.
es_es: Cuando C<S> puede coincidir, es una mejor coincidencia que cuando sólo puede coincidir C<T>.

source: =head4 Character set modifier behavior prior to Perl 5.14
es_es: =head4 Comportamiento del modificador del conjunto de caracteres anterior a Perl 5.14

source: C<User::grent> upgraded to version 1.01
es_es: C<User::grent> actualizado a la versión 1.01

source: Don't be afraid to use loop labels--they're there to enhance readability as well as to allow multilevel loop breaks.
es_es: No se asuste de usar etiquetas de bucles -están para aumentar la legibilidad así como permitir rupturas de bucles multiniveles-.

source: Consider making your code run cleanly with C<use strict> and C<use warnings> (or B<-w>) in effect.
es_es: Considere hacer su código limpio utilizando C<use strict> y C<use warnings> (o B<-w>).

source: NaN != NaN returns true, as does NaN != anything else.
es_es: NaN != NaN devuelve verdadero, como con NaN != con cualquier otra cosa.

source: Here are some other more substantive style issues to think about:
es_es: Aquí hay otras cuestiones de estilo que sí que hay que recordar:

source: =head2 Access and Printing
es_es: =head2 Acceso e impresión

source: # $f implicitly closed here
es_es: # $f cerrado aquí implícitamente

source: now do localise variables, given that the $x is a valid variable name.
es_es: ahora localizan variables, teniendo en cuenta que $x es un nombre válido de variable.

source: If a precompiled pattern is embedded in a larger pattern then the effect of "msixpluad" will be propagated appropriately.
es_es: Si un patrón precompilado se incrusta en un patrón más grande entonces los efectos de 'msixpluad' serán propagados apropiadamente.

source: =head3 Special Literals X<special literal> X<__END__> X<__DATA__> X<END> X<DATA> X<end> X<data> X<^D> X<^Z>
es_es: =head3 Literales especiales X<special literal> X<__END__> X<__DATA__> X<END> X<DATA> X<end> X<data> X<^D> X<^Z> X<literal especial>

source: If the construct is a here-doc, the ending delimiter is a line that has a terminating string as the content.
es_es: Si la construcción es un documento incrustado, el delimitador final es una línea que tiene como contenido una cadena de terminación.

source: The regression test ext/threads/shared/t/wait.t fails on early RedHat 9 and HP-UX 10.20 due to bugs in their threading implementations.
es_es: El test de regresión ext/threads/shared/t/wait.t falla en los primeros RedHat 9 y HP-UX 10.20 debido a errores en las implementaciones de los hilos.

source: NEXTKEY this, lastkey
es_es: NEXTKEY este, últimaclave

source: left terms and list operators (leftward)
es_es: izquierda términos y operadores de listas (por la izquierda)

source: The modifiers C</imsxadlup> may also be embedded within the regular expression itself using the C<(?...)> construct, see L</Extended Patterns> below.
es_es: Estos modificadores C</imsxadlup> también pueden ser incorporados dentro de la propia expresión regular usando la construcción C<(?...)>; vea L</Patrones extendidos> más abajo.

source: This matches the same substring as a standalone C<a+>, and the following C<\g{-1}> eats the matched string; it therefore makes a zero-length assertion into an analogue of C<< (?>...) >>.
es_es: Esto busca la misma subcadena como en C<a+>, y el siguiente C<\g{-1}> se come la cadena coincidente; por lo tanto, hace una aserción de longitud cero, como un análogo de C<< (?>...) >>.

source: Here's how it works: the first time <> is evaluated, the @ARGV array is checked, and if it is empty, C<$ARGV[0]> is set to "-", which when opened gives you standard input.
es_es: He aquí cómo funciona: la primera vez que <> es evaluado, el array @ARGV es comprobado, y si está vacío, C<$ARGV[0]> es configurado a "-", que cuando sea abierto le ofrecerá a usted la entrada estándar.

source: ( (?i) blah ) \s+ \g1
es_es: ( (?i) bla ) \s+ \g1

source: Call your subroutines as if they were functions or list operators to avoid excessive ampersands and parentheses.
es_es: Llame a sus subrutinas como si fueran funciones u operadores de lista para evitar el excesivo número de ligaduras (&&) y paréntesis.

source: 5.8.2 contains an improved implementation which is both source and binary compatible with both 5.8.0 and 5.8.1, and remains robust against the form of attack which prompted the change for 5.8.1.
es_es: 5.8.2 contiene una implementación mejorada que es a la vez compatible a nivel de código fuente y binario con 5.8.0 y 5.8.1, y se mantiene robusto contra la forma de ataque que provocó el cambio de 5.8.1.

source: Any backslashed sequences including C<\\> are treated at the stage to L</"parsing regular expressions">.
es_es: Cualquier secuencia de barras invertidas, incluyendo C<\\> son tratadas en la fase L</"analizando expresiones regulares">.

source: U A Unicode character number.
es_es: U Un número de un carácter Unicode.

source: print; # prints contents of $_ by default
es_es: print; # imprime el contenido de $_ de manera predeterminada

source: Pops and returns the last value of the array, shortening the array by one element.
es_es: Extrae y devuelve el último valor del array, acortando el array en un elemento.

source: You have to make "/hurd/pfinet" the translator for "/servers/socket/2", giving it the right arguments.
es_es: Debe establecer "/hurd/pfinet" como traductor de "/servers/socket/2", suministrándole los argumentos correctos.

source: If the only problem was that the program exited non-zero, C<$!> will be set to C<0>.
es_es: Si el único problema fue que el programa salió distinto de cero, C<$!> se establecerá a C<0>.

source: If the C</x> modifier enables whitespace formatting, a simple C<#> will suffice.
es_es: Si el modificador C</x> permite formateo con espacio en blanco, un simple C<#> será suficiente.

source: If a character that isn't an octal digit is encountered, a warning is raised, and the value is based on the octal digits before it, discarding it and all following characters up to the closing brace.
es_es: Si se encuentra un carácter que no es un dígito octal, se produce una advertencia, y el valor se calcula en los dígitos octales anteriores a él, descartandolo a él y a todos los caracteres siguientes hasta la llave de cierre.

# print STDOUT "stdout 1 "; # this works for
source: print STDOUT "stdout 1\n"; # this works for
es_es: print STDOUT "stdout 1\n"; # esto funciona

source: will now fail with the error:
es_es: ahora fallará con el error:

source: Because C<use> takes effect at compile time, it doesn't respect the ordinary flow control of the code being compiled.
es_es: Dado que C<use> entra en vigor en tiempo de compilación, no respeta el control de flujo de operaciones del código compilado.

source: Note that this doesn't mean everything is an integer, merely that Perl will use integer operations for arithmetic, comparison, and bitwise operators.
es_es: Tenga en cuenta que esto no significa que todo sea un número entero, sino simplemente que Perl utilizará operaciones de enteros para los operadores aritméticos, de comparación y de operaciones con bits.

source: Line numbers (C<$.>) continue as though the input were one big happy file.
es_es: Los números de línea (C<$.>) continuarán como si la entrada fuese un único archivo.

source: When C<\x> is followed by fewer than two valid digits, any valid digits will be zero-padded.
es_es: Cuando C<\x> esté seguido por menos de dos dígitos válidos, los dígitos válidos serán rellenados con ceros.

source: =head2 How can I get a binary version of perl?
es_es: =head2 ¿Cómo puedo obtener una versión binaria de perl?

source: There are similar C<\p{...}> constructs that can match white space and Posix classes beyond ASCII.
es_es: Hay construcciones C<\p{...}> similares que pueden coincidir con espacio en blanco y clases Posix más allá del ASCII.

source: For example, if you had C<en_US.UTF-8> as your locale, your STDIN and STDOUT were automatically "UTF-8", in other words an implicit binmode(..., ":utf8") was made.
es_es: Por ejemplo, si usted tenía C<en_US.UTF-8> como su configuración local, su STDIN y STDOUT fueron automáticamente "UTF-8", en otras palabras, se hizo un binmode(..., ": utf8") de forma implícita.

source: As the 5.6.1 kit was being assembled the following "failures" were known to appear on some machines during "make test" (mostly due to ASCII vs. EBCDIC conflicts), your results may differ:
es_es: A medida que el kit 5.6.1 se estaba ensamblando, aparecieron los siguientes "fallos" en algunas máquinas durante el "make test" (en su mayoría debido a los conflictos ASCII vs EBCDIC), los resultados pueden ser diferentes:

source: So the following will only return an alpha:
es_es: Así que lo siguiente sólo devolverá un alfa:

source: \N{U+263D} Unicode character (example: FIRST QUARTER MOON)
es_es: \N{U+263D} carácter Unicode (ejemplo: FIRST QUARTER MOON)

source: For example, most networking protocols expect and prefer a CR+LF (C<"\015\012"> or C<"\cM\cJ">) for line terminators, and although they often accept just C<"\012">, they seldom tolerate just C<"\015">.
es_es: Por ejemplo, la mayoría de protocolos de red esperan y prefieren un CR+LF (C<"\015\012"> o C<"\cM\cJ">) como terminadores de línea, y aunque a menudo aceptan sólo C<"\012">, rara vez tolerarán sólo un C<"\015">.

source: These statements are simply written in the script in a straightforward fashion.
es_es: Estas instrucciones se escriben directamente en el script.

source: Text after __DATA__ may be read via the filehandle C<PACKNAME::DATA>, where C<PACKNAME> is the package that was current when the __DATA__ token was encountered.
es_es: El texto después de __DATA__ se puede leer a través del identificador de archivo C<PAQUETE::DATA>, donde C<PAQUETE> es el paquete que estaba en curso cuando se encontró el símbolo __DATA__.

source: This is caused by the fact that a block by itself acts as a loop that executes once, see L<"Basic BLOCKs">.
es_es: Esto funciona así por el hecho de que un bloque, por sí mismo, actúa como un bucle que se ejecuta una sola vez. Ver L<"BLOQUES básicos">.

source: This feature caused too many problems, so the feature was turned off and redesigned: see L</"Core Enhancements">.
es_es: Esta característica causaba muchos problemas, por lo que la función se ha desactivado y rediseñado: vea L</"Mejoras del núcleo">.

source: double values _and_ if Perl has been compiled to support those.
es_es: dobles __y__ si Perl ha sido compilado para soportarlos.

source: Described in L<perlembed>, L<perlxstut>, L<perlxs>, L<perlcall>, L<perlguts>, and L<xsubpp>.
es_es: Se describe en L<perlembed>, L<perlxstut>, L<perlxs>, L<perlcall>, L<perlguts> y L<xsubpp>.

source: Always check the return codes of system calls.
es_es: Siempre compruebe los valores devueltos por las llamadas al sistema.

source: Thus this modifier changes behavior only when the C<"/i"> modifier is also specified, and it turns out it affects only two characters, giving them full Unicode semantics: the C<MICRO SIGN> will match the Greek capital and small letters C<MU>, otherwise not; and the C<LATIN CAPITAL LETTER SHARP S> will match any of C<SS>, C<Ss>, C<sS>, and C<ss>, otherwise not.
es_es: Así, este modificador sólo cambia el comportamiento cuando el modificador C<"/i"> también es especificado, y resulte que sólo afecte a dos caracteres, dándoles una semántica completa de Unicode: el C<MICRO SIGN> coincidirá con las letras griegas mayúscula y minúscula de C<MU>, de lo contrario, no; y la C<LATIN CAPITAL LETTER SHARP S> coincidirá con cualquiera de C<SS>, C<Ss>, C<sS>, y C<ss>; de lo contrario, no.

source: Useful modules to help you write tests (with minimum impact on your development process or your time) include Test::Simple, Carp::Assert and Test::Inline.
es_es: Módulos útiles que le ayudarán a escribir las pruebas (con un impacto mínimo en el proceso de desarrollo o de su tiempo) son Test::Simple, Carp::Assert y Test::Inline.

source: For an introduction to the language's features, see pod/perlintro.pod.
es_es: Para una introducción a las características del lenguaje, consulte pod/perlintro.pod.

source: The reason I said "in this instance" is because that I<only> works because C<$AoA[0]> already held an array reference.
es_es: La razón por la que he dicho "en este caso" se debe a que funciona I<solo> porque C<$AoA[0]> ya contiene, realmente, una referencia a un array.

source: You can also do
es_es: También puede hacer

source: These examples of the triple-dot work:
es_es: Estos ejemplos del triple punto funcionan:

source: All list elements are numeric and come straight out of the C `struct tm'.
es_es: Todos los elementos de la lista son numéricos y derivan de la 'struct tm' de C.

source: It has been added to solve semantic problems with the C<isa()> method.
es_es: Se ha añadido para resolver los problemas de semántica con el método C<isa()>.

source: =item "Standard Version"
es_es: =item "Versión Estándar"

source: %hash = map { get_a_key_for($_) => $_ } @array;
es_es: %hash = map { una_clave_para($_) => $_ } @array;

# flock($fh, LOCK_EX) or die "Cannot lock mailbox - $! ";
source: flock($fh, LOCK_EX) or die "Cannot lock mailbox - $!\n";
es_es: flock($fh, LOCK_EX) or die "No puedo bloquear el buzón - $!\n";

source: is whoever is named in the copyright or copyrights for the package.
es_es: es el que se nombra en el derecho de autor o derechos de autor para el paquete.

source: 4_294_967_296 # underscore for legibility
es_es: 4_294_967_296 # guión bajo para legibilidad

source: See L<perl590delta>, L<perl591delta> and L<perl592delta> for the differences between 5.8.0 and 5.9.2.
es_es: Vea L<perl590delta>, L<perl591delta> y L<perl592delta> para las diferencias entre 5.8.0 y 5.9.2.

source: print <<"foo", <<"bar"; # you can stack them
es_es: print <<"foo", <<"bar"; # puede apilarles

source: Prior to that there were no named nor relative numbered capture groups.
es_es: Antes de esto, no existían los grupos de captura numerados de forma relativa, o mediante un nombre de grupo.

source: produces the output 'h:i:t:h:e:r:e'.
es_es: produce la salida 'h:o:l:a:p:o:r:a:q:u:i'.

source: C<Math::BigInt::FastCalc> is an XS-enabled, and thus faster, version of C<Math::BigInt::Calc>.
es_es: C<Math::BigInt::FastCalc> es una versión XS, y por lo tanto más rápida, de C<Math::BigInt::Calc>.

source: =head2 Strictness and warnings
es_es: =head2 Rigor y advertencias

source: Sun Microsystems has released a port of their Sun Studio compilers for Linux.
es_es: Sun Microsystems ha lanzado una versión de sus compiladores Sun Studio para Linux.

source: "aa0" =~ /${a}0/; # False!
es_es: "aa0" =~ /${a}0/; # ¡Falso!

source: Returns the integer portion of EXPR.
es_es: Devuelve la parte entera de EXPR.

source: =item chr NUMBER X<chr> X<character> X<ASCII> X<Unicode>
es_es: =item chr NÚMERO X<chr> X<character> X<ASCII> X<Unicode> X<carácter>

source: Space before the opening curly of a multi-line BLOCK.
es_es: Espacio antes de llave de apertura de un BLOQUE multilínea.

source: L<perltodo> now lists a rough roadmap to Perl 5.10.
es_es: L<perltodo> ahora lista una hoja de ruta aproximada de Perl 5.10.

source: The GSM 03.38 conversion did not handle escape sequences correctly.
es_es: La conversión GSM 03.38 no maneja correctamente las secuencias de escape.

source: =head2 Inappropriate documentation
es_es: =head2 Documentación inapropiada

source: open (FH, $path) or return undef;
es_es: open (FH, $ruta) or return undef;

source: (But if you're not, you should as always feel perfectly free to write for your own system's idiosyncrasies (sometimes called "features").
es_es: (Pero si no, puede siempre sentirse libre de escribir sus propias idiosincrasias del sistema (algunas veces llamadas "features" -características-).

source: Perl is a contextually polymorphic language whose scalars can be strings, numbers, or references (which includes objects).
es_es: Perl es un lenguaje contextualmente polimórfico según el contexto, cuyos escalares pueden ser cadenas, números o referencias (las cuales incluyen a los objetos).

source: Forcing a numeric value to a particular format does not change the number stored in the value.
es_es: Forzar la conversión de un valor numérico a un formato específico no cambia el número almacenado en el valor.

source: See F<Cross/README> for more details.
es_es: Puede ver más detalles en F<Cross/README>.

source: Also using C<< +< >> works for symmetry, but you really should consider writing something to the temporary file first.
es_es: También, usando C<< +< >> trabaja de forma simétrica, pero debe considerar, escribir antes algo en el archivo temporal.

source: Then do the compilation with
es_es: Entonces, realice la compilación con

source: Write documentation in POD
es_es: Escriba documentación en POD

source: There are really two tracks of perl development: a maintenance version and an experimental version.
es_es: Hay dos líneas de desarrollo de perl: una versión de mantenimiento y una versión experimental.

source: Note: An improved implementation of C<threads::shared> is available on CPAN - this will be merged into 5.8.9 if it proves stable.
es_es: Nota: Una mejor implementación de C<threads::shared> está disponible en CPAN - esto será fusionado en 5.8.9 si se prueba que es estable.
